app/controllers/bugs_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "bugs" ("title", "body", "status", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "fsdbdf"], ["body", "rgberg"], ["status", 0], ["project_id", 3], ["created_at", "2020-07-28 17:30:56.830676"], ["updated_at", "2020-07-28 17:30:56.830676"]]
---
	def create
    	@project = Project.find(params[:project_id])
    	@bug = @project.bugs.create(bug_params)