app/controllers/projects_controller.rb

  def create
  	@project = Project.new(project_params)
  	@project.user= current_user

  	if @project.save
---
INSERT INTO "projects" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rtgrtgvrt"], ["body", "erverve"], ["user_id", 1], ["created_at", "2020-07-28 16:58:16.018848"], ["updated_at", "2020-07-28 16:58:16.018848"]]

	def update
  	@project = Project.find(params[:id])

  	if @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "projects" SET "body" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["body", "wecwecw"], ["updated_at", "2020-07-28 12:13:26.784123"], ["id", 3]]